In [1]:
try:
    import duckdb
except:
    ! pip install duckdb
    ! pip install jupysql
    ! pip install duckdb-engine
    import duckdb
# Restart kernel after install

In [2]:
# Load jupySQL extension
%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

In [4]:
%sql duckdb:///:default:

In [5]:
%%sql
CREATE TABLE ducks AS SELECT 3 AS age, 'mandarin' AS breed;
FROM ducks;

   age     breed
0    3  mandarin

In [6]:
%%sql
alter table ducks
drop column breed;

Empty DataFrame
Columns: [Success]
Index: []

In [7]:
%%sql
select * from ducks;

   age
0    3

In [8]:
%%sql
alter table ducks
add column cosa boolean;

Empty DataFrame
Columns: [Success]
Index: []

In [9]:
%%sql
select * from ducks;

   age cosa
0    3  NaN

In [10]:
%%sql
delete from ducks;

Empty DataFrame
Columns: [Success]
Index: []

In [11]:
%%sql
select * from ducks;

Empty DataFrame
Columns: [age, cosa]
Index: []

In [12]:
%%sql
insert into ducks values (1, true);

Empty DataFrame
Columns: [Success]
Index: []

In [13]:
%%sql
select * from ducks;

   age  cosa
0    1  True

In [18]:
%%sql
export database '../../normanbuck/datasets' (format csv);

Empty DataFrame
Columns: [Success]
Index: []

Con esto me convenc√≠ de no usar boolean pues en el csv escribe cadena de caracteres.